<?php

if( !defined('IN_COMBATS') )
{
	die('Попытка взлома');
}

//
// Фразы из сообщений в логах
// 1. Начало сообщения
//
$msg1[] = 'был слишком самоуверен';
$msg1[] = 'вспомнил что-то важное';
$msg1[] = 'выдохся';
$msg1[] = 'высморкался';
$msg1[] = 'думал не о том';
$msg1[] = 'думал о <вырезано цензурой>';
$msg1[] = 'забылся';
$msg1[] = 'задумался';
$msg1[] = 'зажмурился';
$msg1[] = 'закашлялся';
$msg1[] = 'замешкался';
$msg1[] = 'засмотрелся на <вырезано цензурой>';
$msg1[] = 'испугался';
$msg1[] = 'кашлянул';
$msg1[] = 'ковырялся в зубах';
$msg1[] = 'не думал о бое';
$msg1[] = 'не контролировал ситуацию';
$msg1[] = 'не рассчитал свои силы';
$msg1[] = 'обернулся';
$msg1[] = 'обманулся';
$msg1[] = 'осмотрелся';
$msg1[] = 'оступился';
$msg1[] = 'поперхнулся';
$msg1[] = 'потерял момент';
$msg1[] = 'потерял самоконтроль';
$msg1[] = 'поскользнулся';
$msg1[] = 'почесался';
$msg1[] = 'пошатнулся';
$msg1[] = 'пришел в себя';
$msg1[] = 'промахнулся';
$msg1[] = 'прослезился';
$msg1[] = 'просчитался';
$msg1[] = 'пытался нанести удар';
$msg1[] = 'пытался провести удар';
$msg1[] = 'пытался садануть противника';
$msg1[] = 'пытался сконцентрироваться';
$msg1[] = 'пытался увернуться';
$msg1[] = 'пытался что-то сказать';
$msg1[] = 'расплылся в улыбке';
$msg1[] = 'расстроился';
$msg1[] = 'растерялся';
$msg1[] = 'старался нанести удар';
$msg1[] = 'старался провести удар';
$msg1[] = 'удивился';
$msg1[] = 'чесал <вырезано цензурой>';

// 2. Продолжение (это следует за 1 частью)
$msg2[1][] = ' и вдруг, ';
$msg2[1][] = ' и внезапно ';
$msg2[1][] = ' и неожиданно ';
$msg2[1][] = ' и потому ';
$msg2[1][] = ' и тут ';
$msg2[1][] = ', а ';
$msg2[1][] = ', а вследствие чего ';
$msg2[1][] = ', а в это время ';
$msg2[1][] = ', а за это ';
$msg2[1][] = ', а потому ';
$msg2[1][] = ', а тут ';
$msg2[1][] = ', вдруг ';
$msg2[1][] = ', вследствие чего ';
$msg2[1][] = ', за это ';
$msg2[1][] = ', и ';
$msg2[1][] = ', и в это время ';
$msg2[1][] = ', как вдруг ';
$msg2[1][] = ', как внезапно ';
$msg2[1][] = ', как неожиданно ';
$msg2[1][] = ', но ';
$msg2[1][] = ', но в это время ';
$msg2[1][] = ', но вдруг, ';
$msg2[1][] = ', но вдруг, неожиданно ';
$msg2[1][] = ', но внезапно ';
$msg2[1][] = ', но неожиданно ';
$msg2[1][] = ', но тут ';
$msg2[1][] = ', тут ';

$msg2[2][] = '';
$msg2[2][] = 'бесчувственный';
$msg2[2][] = 'безумный';
$msg2[2][] = 'жестокий';
$msg2[2][] = 'задумчивый';
$msg2[2][] = 'злобный';
$msg2[2][] = 'наглый';
$msg2[2][] = 'небритый';
$msg2[2][] = 'непобедимый';
$msg2[2][] = 'обезумевший';
$msg2[2][] = 'продвинутый';
$msg2[2][] = 'разъяренный';
$msg2[2][] = 'расстроенный';
$msg2[2][] = 'хитрый';
// ----------

//
// 3. Конец (при крит. ударе в любую область)
//
$msg3['critical_hit'][1][] = ', в отчаянном рывке,';
$msg3['critical_hit'][1][] = ', забыв все светские манеры,';
$msg3['critical_hit'][1][] = ', напугав всех,';
$msg3['critical_hit'][1][] = ', недобро так нахмурившись,';
$msg3['critical_hit'][1][] = ', не помня себя от испуга,';
$msg3['critical_hit'][1][] = ', не по этикету,';
$msg3['critical_hit'][1][] = ', неожиданно сменив тактику,';
$msg3['critical_hit'][1][] = ', отправив создателей сайта в <вырезано цензурой>,';
$msg3['critical_hit'][1][] = ', послав создателей сайта на <вырезано цензурой>,';
$msg3['critical_hit'][1][] = ', приняв волевое решение,';
$msg3['critical_hit'][1][] = ', прорычав что-то невнятное,';
$msg3['critical_hit'][1][] = ', пуская сопли,';
$msg3['critical_hit'][1][] = ', расслабившись,';
$msg3['critical_hit'][1][] = ', сказав "БУ!",';
$msg3['critical_hit'][1][] = ', удивив всех,';

$msg3['critical_hit'][2][] = 'вломил о<вырезано цензурой>ный';
$msg3['critical_hit'][2][] = 'гениально провел виртуозный захват голени';
$msg3['critical_hit'][2][] = 'ласково заломил руку за спину';
$msg3['critical_hit'][2][] = 'откусил нафиг "защищенное цензурой"!!!';
$msg3['critical_hit'][2][] = 'оторвал 2 пуговицы';
$msg3['critical_hit'][2][] = 'провел болевой прием на ногте';
$msg3['critical_hit'][2][] = 'провел бросок через бедро';
$msg3['critical_hit'][2][] = 'провел заднюю подсечку, завалив';
$msg3['critical_hit'][2][] = 'провел ужасный бросок через пупок';
$msg3['critical_hit'][2][] = 'расцарапал нос';
$msg3['critical_hit'][2][] = 'расцарапал физиономию';
$msg3['critical_hit'][2][] = 'укусил в нос';
$msg3['critical_hit'][2][] = 'укусил за <вырезано цензурой>';
$msg3['critical_hit'][2][] = 'ущипнул за мягкое место';

$msg3['critical_hit'][3][] = 'врага.';
$msg3['critical_hit'][3][] = 'оппонента.';
$msg3['critical_hit'][3][] = 'противника.';
$msg3['critical_hit'][3][] = 'соперника.';
// ----------

//
// 3. Конец (при ударе)
//
$msg3['attack'][1][] = '';
$msg3['attack'][1][] = ' беспричинно';
$msg3['attack'][1][] = ' ласково';
$msg3['attack'][1][] = ' мимоходом';
$msg3['attack'][1][] = ' нехотя';
$msg3['attack'][1][] = ' опрометчиво';
$msg3['attack'][1][] = ' отчаянно';
$msg3['attack'][1][] = ' робко';
$msg3['attack'][1][] = ' с испугу';
$msg3['attack'][1][] = ' сдуру';
$msg3['attack'][1][] = ' случайно';
$msg3['attack'][1][] = ' со скуки';
$msg3['attack'][1][] = ', зевнув,';
$msg3['attack'][1][] = ', не подумав,';
$msg3['attack'][1][] = ', не помня себя от испуга,';
$msg3['attack'][1][] = ', подмигнув,';
$msg3['attack'][1][] = ', показав сразу два пальца,';
$msg3['attack'][1][] = ', пошатнувшись,';
$msg3['attack'][1][] = ', прослезившись,';
$msg3['attack'][1][] = ', проснувшись,';
$msg3['attack'][1][] = ', сделав двойное сальто,';
$msg3['attack'][1][] = ', удивив всех,';
$msg3['attack'][1][] = ', улыбаясь,';

$msg3['attack'][2][] = 'влепил';
$msg3['attack'][2][] = 'вломил';
$msg3['attack'][2][] = 'нанес';
$msg3['attack'][2][] = 'приложил';
$msg3['attack'][2][] = 'провел';
$msg3['attack'][2][] = 'саданул';

$msg3['attack'][3][] = '';
$msg3['attack'][3][] = 'быстрый';
$msg3['attack'][3][] = 'грубый';
$msg3['attack'][3][] = 'красивый';
$msg3['attack'][3][] = 'ловкий';
$msg3['attack'][3][] = 'мощный';
$msg3['attack'][3][] = 'наглый';
$msg3['attack'][3][] = 'обманный';
$msg3['attack'][3][] = 'сильный';
$msg3['attack'][3][] = 'скользящий';
$msg3['attack'][3][] = 'точный';
$msg3['attack'][3][] = 'удачный';
$msg3['attack'][3][] = 'хитрый';

$msg3['attack'][4][] = 'тычок';
$msg3['attack'][4][] = 'удар';

$msg3['attack'][5][] = ', пробив блок, ';

$msg3['attack'][6][] = ', пробив защиту, ';

$msg3['attack'][7][] = ', пробив блок щита, ';

$msg3['attack'][8][] = 'врага';
$msg3['attack'][8][] = 'оппонента';
$msg3['attack'][8][] = 'противника';
$msg3['attack'][8][] = 'соперника';

$msg3['attack']['ice'][] = 'замораживающий удар';
$msg3['attack']['ice'][] = 'леденящий удар';
$msg3['attack']['ice'][] = 'морозный удар';
$msg3['attack']['ice'][] = 'обмораживащий удар';
$msg3['attack']['ice'][] = 'стылый удар';

$msg3['attack']['fire'][] = 'пылающий удар';
$msg3['attack']['fire'][] = 'обжигающий удар';
$msg3['attack']['fire'][] = 'огненный удар';

$msg3['attack']['electric'][] = 'электрический удар';

$msg3['attack']['light'][] = 'светлый удар';

$msg3['attack']['dark'][] = 'темный удар';

$msg3['attack']['piercing'][] = 'проникающий удар';
$msg3['attack']['piercing'][] = 'укол';

$msg3['attack']['chopping'][] = 'рубящий удар';

$msg3['attack']['crushing'][] = 'дробящий удар';
$msg3['attack']['crushing'][] = 'оглушающий удар';
$msg3['attack']['crushing'][] = 'разбивающий удар';

$msg3['attack']['cutting'][] = 'рассекающий удар';
$msg3['attack']['cutting'][] = 'режущий удар';
$msg3['attack']['cutting'][] = 'секущий удар';

$msg3['critical_hit_in_block'][] = 'мощнейший';
$msg3['critical_hit_in_block'][] = 'о<вырезано цензурой>ный';
$msg3['critical_hit_in_block'][] = 'сильнейший';
$msg3['critical_hit_in_block'][] = 'точнейший';
// ----------

//
// 3. Конец (при блоке/контрударе/увороте/парировании)
//
$msg3['block'][1][] = 'блокировал';
$msg3['block'][1][] = 'заблокировал';
$msg3['block'][1][] = 'остановил';
$msg3['block'][1][] = 'отбил';
$msg3['block'][1][] = 'поставил блок на';
$msg3['block'][1][] = 'увел';

$msg3['block'][2][] = 'тычок';
$msg3['block'][2][] = 'удар';

$msg3['counterblow'][1][] = 'и нанес контрудар';
$msg3['counterblow'][1][] = 'и вломил контрудар';

$msg3['dodging'][1][] = 'отпрыгнул от удара';
$msg3['dodging'][1][] = 'увернулся от удара';
$msg3['dodging'][1][] = 'уклонился от удара';
$msg3['dodging'][1][] = 'ушел влево от удара';
$msg3['dodging'][1][] = 'ушел в сторону от удара';

$msg3['shield_block'][1][] = 'заблокировал щитом';

$msg3['parry'][1][] = 'парировал';
// ----------

// При атаке или блоке головы
$msg3['head'][] = 'в бровь';
$msg3['head'][] = 'в висок';
$msg3['head'][] = 'в глаз';
$msg3['head'][] = 'в голову';
$msg3['head'][] = 'в горло';
$msg3['head'][] = 'в затылок';
$msg3['head'][] = 'в кадык';
$msg3['head'][] = 'в лоб';
$msg3['head'][] = 'в ноздрю';
$msg3['head'][] = 'в нос';
$msg3['head'][] = 'в подбородок';
$msg3['head'][] = 'в правый глаз';
$msg3['head'][] = 'в репу';
$msg3['head'][] = 'в скулу';
$msg3['head'][] = 'в темечко';
$msg3['head'][] = 'в ухо';
$msg3['head'][] = 'в челюсть';
$msg3['head'][] = 'в шею';
$msg3['head'][] = 'по щекам';
$msg3['head'][] = 'промеж бровей';
$msg3['head'][] = 'промеж глаз';
// ----------

// При атаке или блоке корпуса
$msg3['body'][] = 'в грудь';
$msg3['body'][] = 'в ключицу';
$msg3['body'][] = 'в корпус';
$msg3['body'][] = 'в левую грудь';
$msg3['body'][] = 'в пищевод';
$msg3['body'][] = 'в плечо';
$msg3['body'][] = 'в правую грудь';
$msg3['body'][] = 'в сердце';
$msg3['body'][] = 'в солнечное сплетение';
$msg3['body'][] = 'по ребрам';
$msg3['body'][] = 'под лопатку';
// ----------

// При атаке или блоке живота
$msg3['belly'][] = 'в аппендикс';
$msg3['belly'][] = 'в бок';
$msg3['belly'][] = 'в живот';
$msg3['belly'][] = 'в печень';
$msg3['belly'][] = 'в пояс';
$msg3['belly'][] = 'в пресс';
$msg3['belly'][] = 'в пупок';
$msg3['belly'][] = 'по печени';
$msg3['belly'][] = 'по почкам';
$msg3['belly'][] = 'под дых';
// ----------

// При атаке или блоке пояса(паха)
$msg3['waist'][] = 'в пах';
$msg3['waist'][] = 'в промежность';
$msg3['waist'][] = 'куда обычно не бьют';
$msg3['waist'][] = 'между ног';
$msg3['waist'][] = 'по <вырезано цензурой>';
$msg3['waist'][] = 'по копчику';
$msg3['waist'][] = 'по крестцу';
// ----------

// При атаке или блоке ног
$msg3['leg'][] = 'в колено';
$msg3['leg'][] = 'в лодыжку';
$msg3['leg'][] = 'прямо в пятку';
$msg3['leg'][] = 'по бедрам';
$msg3['leg'][] = 'по левой ноге';
$msg3['leg'][] = 'по ногам';
$msg3['leg'][] = 'по правой ноге';
$msg3['leg'][] = 'по щиколотке';
$msg3['leg'][] = 'по чашечке';
$msg3['leg'][] = 'под коленную чашечку';
// ----------

// Кастеты, ножи
$msg3['w_knife'][] = 'лезвием ножа';
$msg3['w_knife'][] = 'острым ножом';
$msg3['w_knife'][] = 'рукояткой ножа';

// Топоры, секиры
$msg3['w_axe'][] = 'занозой на рукоятке топора';
$msg3['w_axe'][] = 'лезвием топора';
$msg3['w_axe'][] = 'маленьким топорищем';
$msg3['w_axe'][] = 'обухом топора';
$msg3['w_axe'][] = 'ручкой топора';
$msg3['w_axe'][] = 'топором';
$msg3['w_axe'][] = 'тяжелым топором';

// Дубины, булавы
$msg3['w_club'][] = 'гардой';
$msg3['w_club'][] = 'мощным молотом';
$msg3['w_club'][] = 'ручкой молота';
$msg3['w_club'][] = 'тяжелым молотом';

// Мечи
$msg3['w_sword'][] = 'гардой';
$msg3['w_sword'][] = 'клинком меча';
$msg3['w_sword'][] = 'лезвием меча';
$msg3['w_sword'][] = 'ножнами';
$msg3['w_sword'][] = 'острым мечом';
$msg3['w_sword'][] = 'плоской стороной лезвия';
$msg3['w_sword'][] = 'рукояткой меча';

// Магические посохи
$msg3['w_staff'][] = 'посохом';

// Костыли
$msg3['w_crutch'][] = 'костылем';
$msg3['w_crutch'][] = 'набалдашником на костыле';
$msg3['w_crutch'][] = 'рукоятью костыля';
$msg3['w_crutch'][] = 'тяжелым костылем';
$msg3['w_crutch'][] = 'удобным костылем';

// Елки
$msg3['w_fir'][] = 'чем-то зеленым';

// Букеты
$msg3['w_flowers'][] = 'бутоном цветка';
$msg3['w_flowers'][] = 'красивым букетом';
$msg3['w_flowers'][] = 'лепестками цветов';

// Руками, ногами
$msg3['w_hand'][] = 'головой';
$msg3['w_hand'][] = 'грудью';
$msg3['w_hand'][] = 'кистью руки';
$msg3['w_hand'][] = 'коленом';
$msg3['w_hand'][] = 'копчиком';
$msg3['w_hand'][] = 'кулаком';
$msg3['w_hand'][] = 'ладонью';
$msg3['w_hand'][] = 'локтем';
$msg3['w_hand'][] = 'ногой';
$msg3['w_hand'][] = 'открытой ладонью';
$msg3['w_hand'][] = 'пальцем';

?>